### Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Data loading

In [2]:
df_category = pd.read_csv('./dataset/category.csv')
df_products = pd.read_csv('./dataset/products.csv')
df_sales =  pd.read_csv('./dataset/sales.csv')
df_stores =  pd.read_csv('./dataset/stores.csv')
df_warranty = pd.read_csv('./dataset/warranty.csv')

### Initial Data Exploration

In [8]:
df_category.info()
df_category.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   category_id    10 non-null     object
 1   category_name  10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

  category_id category_name
0       CAT-1        Laptop
1       CAT-2         Audio
2       CAT-3        Tablet
3       CAT-4    Smartphone
4       CAT-5      Wearable

In [9]:
df_products.info()
df_products.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product_ID    89 non-null     object
 1   Product_Name  89 non-null     object
 2   Category_ID   89 non-null     object
 3   Launch_Date   89 non-null     object
 4   Price         89 non-null     int64
dtypes: int64(1), object(4)
memory usage: 3.6+ KB

  Product_ID         Product_Name Category_ID Launch_Date  Price
0        P-1              MacBook       CAT-1  2023-09-17   1149
1        P-2     MacBook Air (M1)       CAT-1  2023-11-11   1783
2        P-3     MacBook Air (M2)       CAT-1  2020-05-24   1588
3        P-4  MacBook Pro 13-inch       CAT-1  2021-01-17   1351
4        P-5  MacBook Pro 14-inch       CAT-1  2024-05-12    768

In [10]:
df_sales.info()
df_sales.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1040200 entries, 0 to 1040199
Data columns (total 5 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   sale_id     1040200 non-null  object
 1   sale_date   1040200 non-null  object
 2   store_id    1040200 non-null  object
 3   product_id  1040200 non-null  object
 4   quantity    1040200 non-null  int64
dtypes: int64(1), object(4)
memory usage: 39.7+ MB

     sale_id   sale_date store_id product_id  quantity
0    YG-8782  16-06-2023    ST-10       P-38        10
1  QX-999001  13-04-2022    ST-63       P-48        10
2   JG-46890  05-07-2021    ST-26       P-79         5
3    XJ-1731  20-07-2022    ST-15       P-24         9
4   FG-95080  18-03-2022    ST-35       P-69         7

In [11]:
df_stores.info()
df_stores.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Store_ID    75 non-null     object
 1   Store_Name  75 non-null     object
 2   City        75 non-null     object
 3   Country     75 non-null     object
dtypes: object(4)
memory usage: 2.5+ KB

  Store_ID             Store_Name           City        Country
0     ST-1     Apple Fifth Avenue       New York  United States
1     ST-2     Apple Union Square  San Francisco  United States
2     ST-3  Apple Michigan Avenue        Chicago  United States
3     ST-4        Apple The Grove    Los Angeles  United States
4     ST-5             Apple SoHo       New York  United States

In [12]:
df_warranty.info()
df_warranty.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   claim_id       30000 non-null  object
 1   claim_date     30000 non-null  object
 2   sale_id        30000 non-null  object
 3   repair_status  30000 non-null  object
dtypes: object(4)
memory usage: 937.6+ KB

   claim_id  claim_date    sale_id repair_status
0  CL-58750  2024-01-30    YG-8782     Completed
1   CL-8874  2024-06-25  QX-999001       Pending
2  CL-14486  2024-08-13   JG-46890       Pending
3  CL-42187  2024-09-19    XJ-1731       Pending
4  CL-37590  2024-09-16   FG-95080     Completed